Examinator/src/Catalogs/ШкалыОценокСУО/ШкалыОценокСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШкалыОценокСУО</name>
  <predefined>
    <items>
      <name>Двухбалльная</name>
      <description>Двухбалльная</description>
    </items>
    <items>
      <name>Десятибалльная</name>
      <description>Десятибалльная</description>
    </items>
    <items>
      <name>НеОценивается</name>
      <description>Не оценивается</description>
    </items>
    <items>
      <name>Пятибалльная</name>
      <description>Пятибалльная</description>
    </items>
    <items>
      <name>Стобалльная</name>
      <description>Стобалльная</description>
    </items>
  </predefined>
</mdclass:Catalog>

Examinator/src/Catalogs/ЭлементыШкалыОценокСУО/ЭлементыШкалыОценокСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭлементыШкалыОценокСУО</name>
  <owners>Catalog.ШкалыОценокСУО</owners>
  <attributes>
    <name>КоличествоБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗначенияБаллов</name>
    <comment>Используется для получения оценки из количества баллов</comment>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ШкалыОценокСУО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ШкалаОценокПоУмолчанию() Экспорт
	Возврат УправлениеОбучениемСУОПовтИсп.ПолучитьШкалуОценокПоУмолчанию();	
КонецФункции

// Конвертирует баллы в значение заданной шкалы.
//
Функция ОценкаИзБаллов(Баллы, Шкала = Неопределено, ВывестиСтруктуру = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Шкала) Тогда
		Шкала = ШкалаОценокПоУмолчанию();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЭлементыШкалыОценокСУОЗначенияБаллов.Ссылка КАК ЗначениеШкалы,
		|	ЭлементыШкалыОценокСУОЗначенияБаллов.Ссылка.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ЭлементыШкалыОценокСУО.ЗначенияБаллов КАК ЭлементыШкалыОценокСУОЗначенияБаллов
		|ГДЕ
		|	ЭлементыШкалыОценокСУОЗначенияБаллов.Ссылка.Владелец = &Шкала
		|	И ЭлементыШкалыОценокСУОЗначенияБаллов.Значение = &ЗначениеБаллов
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭлементыШкалыОценокСУОЗначенияБаллов.Ссылка.Код";

	Запрос.УстановитьПараметр("ЗначениеБаллов", Баллы);
	Запрос.УстановитьПараметр("Шкала", Шкала);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Если ВывестиСтруктуру Тогда		
		Возврат Новый Структура("Ссылка, Наименование",
			ВыборкаДетальныеЗаписи.ЗначениеШкалы, ВыборкаДетальныеЗаписи.Наименование);		
	Иначе
		Возврат ВыборкаДетальныеЗаписи.ЗначениеШкалы;
	КонецЕсли;
		
КонецФункции

// Возвращает количество баллов для оценки.
// По умолчанию возвращает максимально возможное количество
// баллов, но при задании Минимум = Истина, может возвращать
// минимально возможное количество баллов.
//
Функция БаллыИзОценки(Оценка) Экспорт

	Если НЕ ЗначениеЗаполнено(Оценка) Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Оценка, "КоличествоБаллов");	
	
КонецФункции

Функция БаллыИзОценкиСтараяВерсия(Оценка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЭлементыШкалыОценокСУОЗначенияБаллов.Значение
		|ИЗ
		|	Справочник.ЭлементыШкалыОценокСУО.ЗначенияБаллов КАК ЭлементыШкалыОценокСУОЗначенияБаллов
		|ГДЕ
		|	ЭлементыШкалыОценокСУОЗначенияБаллов.Ссылка = &Оценка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭлементыШкалыОценокСУОЗначенияБаллов.Значение УБЫВ";

	Запрос.УстановитьПараметр("Оценка", Оценка);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Значение;
	Иначе
		Возврат 0;
	КонецЕсли;	
	
КонецФункции

Функция ШкалаОценокXDTO(Шкала) Экспорт
	
	// Делаем проверки
	
	Если НЕ ЗначениеЗаполнено(Шкала) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Создаем XDTO объект
	
	ШкалаОценокXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/3/EduMarks", "ШкалаОценок");
	
	ШкалаОценокXDTO = ФабрикаXDTO.Создать(ШкалаОценокXDTOТип);
	ШкалаОценокXDTO.Наименование  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Шкала, "Наименование");
	ШкалаОценокXDTO.Идентификатор = Шкала.УникальныйИдентификатор();
	
	ОценкаXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/3/EduMarks", "Оценка");
	ОценкиXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/3/EduMarks", "Оценки");
	
	ОценкиXDTO = ФабрикаXDTO.Создать(ОценкиXDTOТип);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭлементыШкалыОценокСУО.Ссылка,
		|	ЭлементыШкалыОценокСУО.Наименование
		|ИЗ
		|	Справочник.ЭлементыШкалыОценокСУО КАК ЭлементыШкалыОценокСУО
		|ГДЕ
		|	ЭлементыШкалыОценокСУО.Владелец = &Шкала
		|	И ЭлементыШкалыОценокСУО.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭлементыШкалыОценокСУО.Код";
	
	Запрос.УстановитьПараметр("Шкала", Шкала);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ОценкаXDTO = ФабрикаXDTO.Создать(ОценкаXDTOТип);
		ОценкаXDTO.Наименование = ВыборкаДетальныеЗаписи.Наименование;
		ОценкаXDTO.Идентификатор = ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор();
		
		ОценкиXDTO.Оценка.Добавить(ОценкаXDTO);
		
	КонецЦикла;
	
	ШкалаОценокXDTO.Оценки = ОценкиXDTO;
	
	// Завершаем
	
	Возврат ШкалаОценокXDTO;
	
КонецФункции

Функция ШкалаОценокСтруктура(Шкала) Экспорт
	
	// Делаем проверки
	
	Если НЕ ЗначениеЗаполнено(Шкала) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Формируем данные

	ШкалаОценок = Новый Структура("Наименование, Идентификатор, Оценки");	
	
	ШкалаОценок.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Шкала, "Наименование");
	ШкалаОценок.Идентификатор = Строка(Шкала.УникальныйИдентификатор());	
	ШкалаОценок.Оценки = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭлементыШкалыОценокСУО.Ссылка КАК Ссылка,
		|	ЭлементыШкалыОценокСУО.Наименование КАК Наименование,
		|	ЭлементыШкалыОценокСУО.КоличествоБаллов КАК КоличествоБаллов
		|ИЗ
		|	Справочник.ЭлементыШкалыОценокСУО КАК ЭлементыШкалыОценокСУО
		|ГДЕ
		|	ЭлементыШкалыОценокСУО.Владелец = &Шкала
		|	И ЭлементыШкалыОценокСУО.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭлементыШкалыОценокСУО.Код";
	
	Запрос.УстановитьПараметр("Шкала", Шкала);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		
		
		Оценка = Новый Структура("Наименование, Идентификатор, Баллы",
			ВыборкаДетальныеЗаписи.Наименование,
			ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор(),
			ВыборкаДетальныеЗаписи.КоличествоБаллов);
			
		ШкалаОценок.Оценки.Добавить(Оценка);
	
	КонецЦикла;
	
	// Завершаем
	
	Возврат ШкалаОценок;
	
КонецФункции

Функция ПоказыватьБаллыВместеСОценкой(Шкала) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Шкала)
		ИЛИ Шкала = Справочники.ШкалыОценокСУО.Стобалльная
		ИЛИ Шкала = Справочники.ШкалыОценокСУО.НеОценивается Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПроходнаяОценкаСтрока(ПроходнойБалл, ШкалаОценок) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ПроходнойБалл)
		ИЛИ НЕ ЗначениеЗаполнено(ШкалаОценок) Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЭлементыШкалыОценокСУО.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ЭлементыШкалыОценокСУО КАК ЭлементыШкалыОценокСУО
		|ГДЕ
		|	ЭлементыШкалыОценокСУО.Владелец = &ШкалаОценок
		|	И ЭлементыШкалыОценокСУО.КоличествоБаллов >= &ПроходнойБалл
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭлементыШкалыОценокСУО.Код";
	
	Запрос.УстановитьПараметр("ПроходнойБалл", ПроходнойБалл);
	Запрос.УстановитьПараметр("ШкалаОценок", ШкалаОценок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Наименование;
	
КонецФункции

Функция БаллыВПятибалльнуюОценкуЧислом(Баллы) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОценкаПятибалльная = ОценкаИзБаллов(Баллы, Справочники.ШкалыОценокСУО.Пятибалльная);
	
	ОценкаИЧисло = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭлементыШкалыОценокСУО.Ссылка КАК Оценка
		|ИЗ
		|	Справочник.ЭлементыШкалыОценокСУО КАК ЭлементыШкалыОценокСУО
		|ГДЕ
		|	ЭлементыШкалыОценокСУО.Владелец = &ПятибалльнаяШкала
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭлементыШкалыОценокСУО.Код";
	
	Запрос.УстановитьПараметр("ПятибалльнаяШкала", Справочники.ШкалыОценокСУО.Пятибалльная);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОценкаИЧисло = ОценкаИЧисло + 1;
		Если ВыборкаДетальныеЗаписи.Оценка = ОценкаПятибалльная Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ОценкаИЧисло)
		ИЛИ ОценкаИЧисло > 5 Тогда		
		ВызватьИсключение НСтр("ru = 'Невозможно преобразовать баллы в пятибалльную оценку числом'");		
	КонецЕсли;
	
	Возврат ОценкаИЧисло;
	
КонецФункции


#КонецЕсли
